{
    "data": [
        {
            "title": "Angular Front-end Engineer - RDC Viagens",
            "skills": [
                {"name": "TypeScript", "icon": "typescript"},
                {"name": "Angular", "icon": "angular"},
                {"name": "NgXS", "icon": "ngrx"},
                {"name": "RxJS", "icon": "rxjs"},
                {"name": "Docker", "icon": "docker"},
                {"name": "Jest", "icon": "jest"}
            ],
            "workDescription": "Angular Front-end Developer responsible for designing, developing, and maintaining web applications that deliver an exceptional user experience. Expertise in Angular, TypeScript, HTML, and SCSS that are crucial in creating responsive, efficient, and visually appealing web solutions.",
            "workItems": [
                "Develop user interfaces for web applications using Angular, ensuring high performance and responsiveness;",
                "Collaborate with UI/UX designers to implement user interfaces that match the design specifications;",
                "Utilized project management tools such as Jira, Slack and Mural to optimize team performance and reach objectives;",
                "Identify and address performance bottlenecks and implement solutions to enhance application performance. Stay up-to-date with the latest Angular and web development trends, tools, and technologies."
            ],
            "duration": "2 years"
        },
        {
            "title": "Front-end AI Trainer for Coding - Revelo",
            "skills": [
                {"name": "TypeScript", "icon": "typescript"},
                {"name": "React", "icon": "react"},
                {"name": "Next.JS", "icon": "nextjs"}
            ],
            "workDescription": "AI Trainers for Coding to help fine-tune AI models by reviewing and improving AI-generated code.",
            "workItems": [
                "Tackling coding challenges and reviewing AI-generated code, ensuring it meets the high standards of real-world developers",
                "Give insights that will help refine AI models, making them more effective at solving programming tasks",
                "Develop user interfaces for web applications using React, ensuring responsiveness and highly matched with prototype;"
            ],
            "duration": "2 months"
        },
        {
            "title": "Front-end Developer - EIS",
            "skills": [
                {"name": "TypeScript", "icon": "typescript"},
                {"name": "React", "icon": "react"},
                {"name": "RxJS", "icon": "rxjs"},
                {"name": "Docker", "icon": "docker"},
                {"name": "Jest", "icon": "jest"}
            ],
            "workDescription": "Build new reusable compents using React and Ant Design for React, testing using Jest.",
            "workItems": [
                "Developed modern web applications using React and TypeScript, resulting in enhanced user experience;",
                "Built new components and integrated them with API services to improve software functionality;",
                "Utilized project management tools such as Jira, Slack and Mural to optimize team performance and reach objectives;"
            ],
            "duration": "3 months"
        },
        {
            "title": "Software Developer - IBM",
            "skills": [
                {"name": "Angular", "icon": "angular"},
                {"name": "JavaScript", "icon": "javascript"},
                {"name": "TypeScript", "icon": "typescript"},
                {"name": "Node.js", "icon": "nodejs"},
                {"name": "Shell", "icon": "bash"},
                {"name": "Linux", "icon": "linux"},
                {"name": "C", "icon": "c"},
                {"name": "CouchDB", "icon": "couchdb"},
                {"name": "SQL", "icon": "sql"},
                {"name": "Docker", "icon": "docker"},
                {"name": "RxJS", "icon": "rxjs"},
                {"name": "NgRX", "icon": "ngrx"},
                {"name": "Travis CI", "icon": "travis-ci"},
                {"name": "Jenkins", "icon": "jenkins"}
            ],
            "workDescription": "Developer with the aim of helping and building high value solutions using the most recent tecnology and tools. Worked on Billing, ETL, Data-Warehouse and Client Support Systems.",
            "workItems": [
                "Developed WEB applications with Back/Front end functionality, utilizing Node.JS microservices and participating on decisions from the architecture of the system, coding and testing;",
                "Created and maintained Unix Shell scripts for Data Warehouse batch applications;",
                "Developed a full-featured monitoring WEB application to generate insights and metrics, resulting in 20% cost-savings;",
                "Collaborated with a multi-disciplinary team to convert business needs into technical specifications."
            ],
            "duration": "3 years"
        },
        {
            "title": "Application Developer Intern- IBM",
            "skills": [
                {"name": "JavaScript", "icon": "javascript"},
                {"name": "JQuery", "icon": "jquery"},
                {"name": "PHP", "icon": "php"},
                {"name": "Vue.js", "icon": "vue"},
                {"name": "Node.js", "icon": "nodejs"},
                {"name": "SQL", "icon": "sql"},
                {"name": "Git", "icon": "git"},
                {"name": "JSON", "icon": "json"},
                {"name": "HTML", "icon": "html"},
                {"name": "CSS", "icon": "css"}
            ],
            "workDescription": "Work on finding and developing new improvements and automation for Asset Management.",
            "workItems": [
                "Developed automation feature to generate QR Code tags, increasing employee productivity by 15% daily;",
                "Engineered multiple web applications using JavaScript (JQuery), PHP and DB2;",
                "Collaborated with stakeholders to identify opportunities for process automation, providing analysis and process documentation."
            ],
            "duration": "1.6 years"
        }
    ]
}